In [1]:
import pandas as pd 
from sqlalchemy import create_engine
from sqlalchemy import text

## EXTRACT

In [2]:
df_stores = pd.read_csv("D:/binar/platinum_challenge/Stores.csv", encoding='latin-1')
print(df_stores.head())

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

## PROFILING

In [3]:
df_stores.columns = map(str.lower, df_stores.columns)
df_stores.columns = df_stores.columns.str.replace(' ', '_')

In [4]:
df_stores

,storekey,country,state,square_meters,open_date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,NaN,1/1/2010

In [5]:
df_stores = df_stores.rename(columns={'storekey': 'store_key'})

In [6]:
#duplicate check
selected_data= df_stores[["store_key"]]
selected_data.duplicated().sum()

0

In [7]:
df_stores.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
62    False
63    False
64    False
65    False
66    False
Length: 67, dtype: bool

In [8]:
sum(df_stores.duplicated())

0

In [9]:
#null check
df_stores.isna().sum()
df_stores = df_stores.dropna(axis=0, how="all") 
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   store_key      67 non-null     int64
 1   country        67 non-null     object
 2   state          67 non-null     object
 3   square_meters  66 non-null     float64
 4   open_date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [10]:
df_stores[df_stores.isna().any(axis=1)]

    store_key country   state  square_meters open_date
66          0  Online  Online            NaN  1/1/2010

In [11]:
df_stores['store_key'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66,  0],
      dtype=int64)

In [12]:
df_stores['country'].unique()

array(['Australia', 'Canada', 'France', 'Germany', 'Italy', 'Netherlands',
       'United Kingdom', 'United States', 'Online'], dtype=object)

In [13]:
df_stores['state'].unique()

array(['Australian Capital Territory', 'Northern Territory',
       'South Australia', 'Tasmania', 'Victoria', 'Western Australia',
       'New Brunswick', 'Newfoundland and Labrador',
       'Northwest Territories', 'Nunavut', 'Yukon', 'Basse-Normandie',
       'Corse', 'Franche-ComtÃƒÂ©', 'La RÃƒÂ©union', 'Limousin', 'Martinique',
       'Mayotte', 'Berlin', 'Brandenburg', 'Freie Hansestadt Bremen',
       'Freistaat ThÃƒÂ¼ringen', 'Hamburg', 'Hessen',
       'Mecklenburg-Vorpommern', 'Saarland', 'Sachsen-Anhalt',
       'Caltanissetta', 'Enna', 'Pesaro', 'Drenthe', 'Flevoland',
       'Friesland', 'Groningen', 'Zeeland', 'Armagh', 'Ayrshire',
       'Belfast', 'Blaenau Gwent', 'Dungannon and South Tyrone',
       'Fermanagh', 'North Down', 'Alaska', 'Arkansas', 'Connecticut',
       'Delaware', 'Hawaii', 'Idaho', 'Iowa', 'Kansas', 'Maine',
       'Mississippi', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Mexico', 'North Dakota', 'Oregon', 'Rhode Island',
       'South Carolina', 'South Dakota', 'Utah', 'Washington DC',
       'West Virginia', 'Wyoming', 'Online'], dtype=object)

In [14]:
df_stores['square_meters'].unique()

array([ 595.,  665., 2000., 1105., 2105., 1500., 1210.,  350.,  245.,
        400.,  385.,  310., 1295., 1715.,  560., 1365., 1855., 1610.,
       1200., 1000., 2100., 1085.,  910., 1540., 1225., 1300., 1800.,
       1900., 1190., 1015., 1120., 1260., 1645., 1330., 1785.,  840.,
         nan])

In [15]:
df_stores['open_date'].unique()

array(['1/1/2008', '1/12/2008', '1/7/2012', '1/1/2010', '12/9/2015',
       '5/7/2007', '7/2/2014', '3/4/2005', '4/4/2015', '6/3/2009',
       '6/6/2012', '6/7/2013', '12/15/2009', '1/1/2015', '6/3/2010',
       '7/8/2007', '8/8/2012', '12/15/2012', '6/3/2018', '3/6/2008',
       '3/5/2019', '8/8/2008', '4/4/2005', '1/1/2012', '1/1/2014'],
      dtype=object)

# CLEANSING

In [16]:
df_stores_clean = df_stores.copy()

In [17]:
df_stores_clean

,store_key,country,state,square_meters,open_date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,NaN,1/1/2010

In [19]:
df_stores_clean['open_date'] = pd.to_datetime(df_stores_clean['open_date'])

In [20]:
df_stores_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   store_key      67 non-null     int64
 1   country        67 non-null     object
 2   state          67 non-null     object
 3   square_meters  66 non-null     float64
 4   open_date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [21]:
df_stores_clean

,store_key,country,state,square_meters,open_date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12
2,3,Australia,South Australia,2000.0,2012-01-07
3,4,Australia,Tasmania,2000.0,2010-01-01
4,5,Australia,Victoria,2000.0,2015-12-09
...,...,...,...,...,...
62,63,United States,Utah,2000.0,2008-03-06
63,64,United States,Washington DC,1330.0,2010-01-01
64,65,United States,West Virginia,1785.0,2012-01-01
65,66,United States,Wyoming,840.0,2014-01-01
66,0,Online,Online,NaN,2010-01-01

## INGESTION

In [22]:
# engine = create_engine('postgresql://username:password@localhost:5432/mydatabase')
engine = create_engine('postgresql://postgres:nunu16@localhost:5432/postgres')

connection = engine.connect()

df_stores_clean.to_sql( 
        'stores', 
        con=engine,
        schema='platinum_base_layer',
        if_exists='replace',    
        index=False,
        index_label = 'index',
        method='multi'
        )

67

In [23]:
from sqlalchemy import text

In [24]:
query_pk = [
"alter table platinum_base_layer.stores add primary key(store_key)"
]
for query in query_pk:
    conn_2 = engine.connect()
    conn_2.execute(text(query))
    conn_2.commit()
    conn_2.close()